AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Денежный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HTTPServices/Exchange/Ext/Module.bsl
Функция PingGET(Запрос)  
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Результат = Новый Структура("result", "ok");
	ЗаписатьJSON(ЗаписьJSON, Результат);
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ; 
	
КонецФункции

Функция GoodsGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200); 
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	ДатаОстатков = ТекущаяДатаСеанса();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ТаблицаОстатков = Обмен.ОстаткиТоваров(ДатаОстатков); 
	
	ЗаписатьJSON(ЗаписьJSON, ОбщегоНазначения_Сервер.ТаблицаЗначенийВМассив(ТаблицаОстатков));

	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);

	Возврат Ответ;
	
КонецФункции

Функция JWTGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Результат = Новый Структура("token", Обмен.СгенерироватьТокен());
	ЗаписатьJSON(ЗаписьJSON, Результат);
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция GoodsPOST(Запрос)
	
	ТекстОтвет = "";
	КодСостояния = 200;
	СписокНоменклатуры = Новый Массив;
	ВсеДоступно = Истина;
	ТекстОшибкиНедостаточно = "";
	ТекстОшибкиНетНоменклатуры = "";
	Остатки = Новый Соответствие;

	
	//  Чтение и парсинг JSON
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
		ТоварыВЗаказ = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
	Исключение
		ТекстОшибки = "Ошибка разбора JSON: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("HTTP_Exchange_GoodsPOST", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КодСостояния = 400;
		ТекстОтвет = ТекстОшибки;
		Ответ = Новый HTTPСервисОтвет(КодСостояния);
		Ответ.УстановитьТелоИзСтроки(ТекстОтвет);
		Возврат Ответ;
	КонецПопытки; 
		
	//  Проверка существования номенклатуры и сбор списка для запроса
	Для Каждого ТоварИзJSON Из ТоварыВЗаказ Цикл
		
		УИД = Новый УникальныйИдентификатор(ТоварИзJSON["Идентификатор"]);
		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(УИД);
		
		Если Не НоменклатураСсылка.Пустая() Тогда
			СписокНоменклатуры.Добавить(НоменклатураСсылка);
		Иначе
			ВсеДоступно = Ложь;
			ТекстОшибкиНетНоменклатуры = ТекстОшибкиНетНоменклатуры + "Номенклатура с Идентификатором " + ТоварИзJSON["Идентификатор"] + " не найдена. ";
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ВсеДоступно Тогда
		ЗаписьЖурналаРегистрации("HTTP_Exchange_GoodsPOST", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибкиНетНоменклатуры);
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки(ТекстОшибкиНетНоменклатуры);
		Возврат Ответ;
	КонецЕсли;
	
	Если СписокНоменклатуры.Количество() > 0 Тогда
	
		// Подготовка запроса остатков	
		ЗапросОстатков = Новый Запрос;
		ЗапросОстатков.Текст = 
			"ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОстаткиТоваровОстатки.Номенклатура)) КАК Номенклатура,
			|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	ОстаткиТоваровОстатки.Номенклатура.Представление КАК НоменклатураПредставление
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваров.Остатки(&Дата, Номенклатура В (&СписокНоменклатуры)) КАК ОстаткиТоваровОстатки";
		
		ЗапросОстатков.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
		ЗапросОстатков.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
		
		РезультатЗапроса = ЗапросОстатков.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
				
		Пока Выборка.Следующий() Цикл
			Остатки.Вставить(Выборка.Номенклатура, Выборка.КоличествоОстаток);
		КонецЦикла;
		
	Иначе
		ЗаписьЖурналаРегистрации("HTTP_Exchange_GoodsPOST", УровеньЖурналаРегистрации.Ошибка, , , "Пустой запрос");
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Пустой запрос");
		Возврат Ответ;
	КонецЕсли; 
	
	// Создание документа
	ДокументЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	ДокументЗаказ.Дата = ТекущаяДатаСеанса();

	//  Формирование табличной части и проверка достаточности
	Для Каждого Товар Из ТоварыВЗаказ Цикл
		
		ТребуемоеКоличество = Товар["Количество"];
		
		ДоступноеКоличество = Остатки[Товар["Идентификатор"]];
		
		Если ДоступноеКоличество = Неопределено Или ДоступноеКоличество < ТребуемоеКоличество Тогда
			ВсеДоступно = Ложь;
			ТекстОшибкиНедостаточно = ТекстОшибкиНедостаточно + "Недостаточно товара: " + Товар["НоменклатураПредставление"] + ". Требуется: " + ТребуемоеКоличество + ", доступно: " + ?(ДоступноеКоличество = Неопределено, 0, ДоступноеКоличество) + ". ";
		Иначе
			//НоваяСтрока = ДокументЗаказ.Товары.Добавить();
			//НоваяСтрока.Номенклатура = Номенклатура;
			//НоваяСтрока.Количество = ТребуемоеКоличество;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ВсеДоступно Тогда
		ЗаписьЖурналаРегистрации("HTTP_Exchange_GoodsPOST", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибкиНедостаточно);
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки(ТекстОшибкиНедостаточно);
		Возврат Ответ;
	КонецЕсли;
	

	
	// Запись документа и формирование ответа
	Попытка
		//ДокументЗаказ.Записать();
		ТекстОтвета = "Заказ успешно создан. Номер: " + ДокументЗаказ.Номер;
		ЗаписьЖурналаРегистрации("HTTP_Exchange_GoodsPOST", УровеньЖурналаРегистрации.Информация, , , ТекстОтвета);
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	Исключение
		ТекстОшибки = "Ошибка записи документа: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("HTTP_Exchange_GoodsPOST", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции
